import { appRoutes } from "@/shared/constants/routes";
import { Link } from "@tanstack/react-router";

import "./in-work-page.css";

export function InWorkPage() {
    return (
        <div className="in-work-page">
            <svg width="128" height="132" viewBox="0 0 128 132" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M95.4581 88.8797C107.876 99.9983 97.8537 116.968 84.2262 117.042C73.8167 117.097 69.7258 112.567 63.0487 112.602C56.3716 112.638 52.3295 117.212 41.9189 117.268C28.2925 117.341 18.0895 100.477 30.3883 89.2261C45.6721 75.2458 49.9501 57.7416 62.7568 57.6737C75.5651 57.6057 80.0275 75.0621 95.4581 88.8797Z" fill="#FFF7ED"/>
                <path d="M115.464 66.035C114.224 74.9492 107.311 81.3552 100.023 80.3421C92.7345 79.3289 87.8311 71.2806 89.07 62.365C90.5627 51.6348 98.0693 40.9735 105.358 41.9867C112.645 43.0001 117.073 54.4619 115.464 66.035Z" fill="#FFF7ED"/>
                <path d="M32.7504 37.4482C31.6916 25.8118 36.6588 14.5716 43.9869 13.9048C51.315 13.238 58.3067 24.2429 59.2886 35.0322C60.1037 43.9963 54.8238 51.8034 47.497 52.4699C40.1689 53.1368 33.5666 46.4107 32.7504 37.4482Z" fill="#FFF7ED"/>
                <path d="M65.9688 34.9963C66.8358 24.198 73.7102 13.1181 81.0448 13.708C88.3804 14.2962 93.4664 25.4828 92.5309 37.1277C91.8102 46.1005 85.2804 52.8961 77.9446 52.3066C70.6106 51.7195 65.2482 43.9691 65.9688 34.9963Z" fill="#FFF7ED"/>
                <path d="M25.7249 80.7375C18.4485 81.8282 11.4663 75.4973 10.1321 66.5964C8.40053 55.0416 12.7069 43.5321 19.9831 42.4414C27.2607 41.3504 34.8798 51.9308 36.4856 62.6446C37.8197 71.5455 33.0025 79.6465 25.7249 80.7375Z" fill="#FFF7ED"/>
            </svg>
            <div className="in-work-text-conteiner">
                <h1 className="in-work-title">Кажется, эта функция недоступна</h1>
                <p className="in-work-subtitle">Пока что она в разработке, но очень скоро появится здесь.</p>
            </div>
            <Link
                to={appRoutes.home}
                className="in-work-back-btn"
            >
                Главный экран
            </Link>
        </div>
    )
}